package LoopTasks;//Вывод чисел от 1 до 10.
//Напишите программу, которая выводит числа от 1 до 10, используя цикл for.

public class LoopTask1 {

    public static void main(String[] args){

     for(int i = 0; i < 11; i++){
         System.out.print(i + " ");
     }
    }
}
